socialNetwork/wrk2/outs/c50_r100.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.063ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.011ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.13ms    1.58ms   9.89ms   91.87%
    Req/Sec    52.00     73.58   300.00     90.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.69ms
 75.000%    3.18ms
 90.000%    4.37ms
 99.000%    9.89ms
 99.900%   19.53ms
 99.990%   26.33ms
 99.999%   26.33ms
100.000%   26.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.617     0.000000            1         1.00
       2.211     0.100000          495         1.11
       2.359     0.200000          994         1.25
       2.471     0.300000         1488         1.43
       2.577     0.400000         1981         1.67
       2.689     0.500000         2481         2.00
       2.757     0.550000         2725         2.22
       2.829     0.600000         2971         2.50
       2.925     0.650000         3219         2.86
       3.039     0.700000         3469         3.33
       3.183     0.750000         3708         4.00
       3.299     0.775000         3836         4.44
       3.421     0.800000         3956         5.00
       3.559     0.825000         4081         5.71
       3.775     0.850000         4203         6.67
       4.019     0.875000         4326         8.00
       4.167     0.887500         4389         8.89
       4.367     0.900000         4450        10.00
       4.567     0.912500         4513        11.43
       4.899     0.925000         4575        13.33
       5.183     0.937500         4635        16.00
       5.347     0.943750         4667        17.78
       5.591     0.950000         4697        20.00
       5.827     0.956250         4730        22.86
       6.123     0.962500         4759        26.67
       6.607     0.968750         4791        32.00
       6.735     0.971875         4805        35.56
       7.127     0.975000         4821        40.00
       7.547     0.978125         4836        45.71
       8.123     0.981250         4852        53.33
       8.831     0.984375         4867        64.00
       9.087     0.985938         4875        71.11
       9.399     0.987500         4883        80.00
       9.639     0.989062         4890        91.43
      10.143     0.990625         4899       106.67
      10.567     0.992188         4906       128.00
      10.871     0.992969         4910       142.22
      11.103     0.993750         4914       160.00
      11.599     0.994531         4917       182.86
      11.967     0.995313         4921       213.33
      12.687     0.996094         4925       256.00
      13.223     0.996484         4927       284.44
      14.487     0.996875         4929       320.00
      14.567     0.997266         4931       365.71
      14.759     0.997656         4933       426.67
      15.551     0.998047         4935       512.00
      16.959     0.998242         4936       568.89
      18.559     0.998437         4937       640.00
      19.295     0.998633         4938       731.43
      19.535     0.998828         4939       853.33
      21.055     0.999023         4940      1024.00
      21.055     0.999121         4940      1137.78
      24.143     0.999219         4941      1280.00
      24.143     0.999316         4941      1462.86
      25.039     0.999414         4942      1706.67
      25.039     0.999512         4942      2048.00
      25.039     0.999561         4942      2275.56
      26.143     0.999609         4943      2560.00
      26.143     0.999658         4943      2925.71
      26.143     0.999707         4943      3413.33
      26.143     0.999756         4943      4096.00
      26.143     0.999780         4943      4551.11
      26.335     0.999805         4944      5120.00
      26.335     1.000000         4944          inf
#[Mean    =        3.127, StdDeviation   =        1.583]
#[Max     =       26.320, Total count    =         4944]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5988 requests in 1.00m, 1.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 31
  Non-2xx or 3xx responses: 5988
Requests/sec:     99.77
Transfer/sec:     25.18KB