socialNetwork/wrk2/outs/c50_r1000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 50 connections
  Thread calibration: mean lat.: 322.441ms, rate sampling interval: 1902ms
  Thread calibration: mean lat.: 279.463ms, rate sampling interval: 1558ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.46ms   16.49ms  83.52ms   92.08%
    Req/Sec   498.62     16.88   530.00     68.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.22ms
 75.000%   10.92ms
 90.000%   22.94ms
 99.000%   83.52ms
 99.900%  176.51ms
 99.990%  282.62ms
 99.999%  315.90ms
100.000%  315.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.026     0.000000            1         1.00
       2.089     0.100000         4992         1.11
       2.647     0.200000         9978         1.25
       3.283     0.300000        14969         1.43
       4.099     0.400000        19954         1.67
       5.215     0.500000        24931         2.00
       5.903     0.550000        27429         2.22
       6.735     0.600000        29921         2.50
       7.759     0.650000        32412         2.86
       9.087     0.700000        34910         3.33
      10.919     0.750000        37401         4.00
      12.039     0.775000        38640         4.44
      13.391     0.800000        39891         5.00
      14.975     0.825000        41133         5.71
      16.975     0.850000        42384         6.67
      19.519     0.875000        43630         8.00
      21.135     0.887500        44251         8.89
      22.943     0.900000        44873        10.00
      25.231     0.912500        45496        11.43
      27.935     0.925000        46120        13.33
      31.231     0.937500        46744        16.00
      33.311     0.943750        47054        17.78
      35.999     0.950000        47367        20.00
      39.135     0.956250        47678        22.86
      42.879     0.962500        47988        26.67
      47.167     0.968750        48301        32.00
      49.727     0.971875        48456        35.56
      52.703     0.975000        48611        40.00
      56.287     0.978125        48767        45.71
      60.767     0.981250        48923        53.33
      66.751     0.984375        49079        64.00
      70.527     0.985938        49160        71.11
      74.559     0.987500        49234        80.00
      79.487     0.989062        49312        91.43
      85.567     0.990625        49390       106.67
      92.863     0.992188        49468       128.00
      96.447     0.992969        49507       142.22
     100.671     0.993750        49548       160.00
     105.151     0.994531        49586       182.86
     112.191     0.995313        49624       213.33
     119.935     0.996094        49664       256.00
     124.735     0.996484        49682       284.44
     129.471     0.996875        49702       320.00
     135.551     0.997266        49721       365.71
     142.207     0.997656        49741       426.67
     150.911     0.998047        49760       512.00
     153.087     0.998242        49770       568.89
     158.079     0.998437        49780       640.00
     161.279     0.998633        49789       731.43
     170.367     0.998828        49799       853.33
     178.815     0.999023        49809      1024.00
     184.831     0.999121        49814      1137.78
     188.415     0.999219        49819      1280.00
     191.615     0.999316        49823      1462.86
     206.207     0.999414        49828      1706.67
     224.895     0.999512        49833      2048.00
     232.191     0.999561        49836      2275.56
     238.335     0.999609        49838      2560.00
     243.839     0.999658        49840      2925.71
     251.135     0.999707        49843      3413.33
     252.799     0.999756        49845      4096.00
     260.095     0.999780        49847      4551.11
     260.479     0.999805        49848      5120.00
     267.263     0.999829        49849      5851.43
     273.919     0.999854        49850      6826.67
     279.295     0.999878        49851      8192.00
     282.623     0.999890        49852      9102.22
     283.391     0.999902        49853     10240.00
     283.391     0.999915        49853     11702.86
     283.903     0.999927        49854     13653.33
     283.903     0.999939        49854     16384.00
     290.047     0.999945        49855     18204.44
     290.047     0.999951        49855     20480.00
     290.047     0.999957        49855     23405.71
     294.143     0.999963        49856     27306.67
     294.143     0.999969        49856     32768.00
     294.143     0.999973        49856     36408.89
     294.143     0.999976        49856     40960.00
     294.143     0.999979        49856     46811.43
     315.903     0.999982        49857     54613.33
     315.903     1.000000        49857          inf
#[Mean    =       10.457, StdDeviation   =       16.490]
#[Max     =      315.648, Total count    =        49857]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59780 requests in 1.00m, 14.76MB read
  Non-2xx or 3xx responses: 59780
Requests/sec:    996.38
Transfer/sec:    251.89KB