socialNetwork/wrk2/outs/c50_r2000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 50 connections
  Thread calibration: mean lat.: 924.292ms, rate sampling interval: 3491ms
  Thread calibration: mean lat.: 1057.942ms, rate sampling interval: 3926ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.25s     2.44s   11.05s    86.86%
    Req/Sec    27.62     63.21   180.00     84.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.92s 
 75.000%    8.29s 
 90.000%    9.36s 
 99.000%   11.05s 
 99.900%   28.25s 
 99.990%   46.04s 
 99.999%   46.04s 
100.000%   46.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3233.791     0.000000            1         1.00
    5070.847     0.100000          269         1.11
    5689.343     0.200000          539         1.25
    6111.231     0.300000          806         1.43
    6549.503     0.400000         1074         1.67
    6918.143     0.500000         1339         2.00
    7155.711     0.550000         1477         2.22
    7360.511     0.600000         1609         2.50
    7659.519     0.650000         1742         2.86
    7983.103     0.700000         1875         3.33
    8294.399     0.750000         2009         4.00
    8404.991     0.775000         2077         4.44
    8552.447     0.800000         2144         5.00
    8708.095     0.825000         2212         5.71
    8929.279     0.850000         2282         6.67
    9158.655     0.875000         2347         8.00
    9265.151     0.887500         2380         8.89
    9363.455     0.900000         2411        10.00
    9551.871     0.912500         2444        11.43
    9715.711     0.925000         2479        13.33
    9830.399     0.937500         2511        16.00
    9904.127     0.943750         2532        17.78
    9969.663     0.950000         2545        20.00
   10067.967     0.956250         2562        22.86
   10149.887     0.962500         2578        26.67
   10248.191     0.968750         2595        32.00
   10313.727     0.971875         2605        35.56
   10395.647     0.975000         2613        40.00
   10452.991     0.978125         2621        45.71
   10534.911     0.981250         2629        53.33
   10633.215     0.984375         2637        64.00
   10764.287     0.985938         2641        71.11
   10829.823     0.987500         2645        80.00
   11026.431     0.989062         2649        91.43
   11116.543     0.990625         2653       106.67
   24739.839     0.992188         2658       128.00
   24821.759     0.992969         2660       142.22
   25165.823     0.993750         2662       160.00
   25722.879     0.994531         2664       182.86
   25919.487     0.995313         2666       213.33
   26951.679     0.996094         2668       256.00
   26984.447     0.996484         2669       284.44
   27049.983     0.996875         2670       320.00
   27181.055     0.997266         2671       365.71
   27262.975     0.997656         2672       426.67
   27623.423     0.998047         2673       512.00
   28164.095     0.998242         2674       568.89
   28164.095     0.998437         2674       640.00
   28246.015     0.998633         2675       731.43
   28246.015     0.998828         2675       853.33
   30801.919     0.999023         2676      1024.00
   30801.919     0.999121         2676      1137.78
   30801.919     0.999219         2676      1280.00
   32063.487     0.999316         2677      1462.86
   32063.487     0.999414         2677      1706.67
   32063.487     0.999512         2677      2048.00
   32063.487     0.999561         2677      2275.56
   32063.487     0.999609         2677      2560.00
   46039.039     0.999658         2678      2925.71
   46039.039     1.000000         2678          inf
#[Mean    =     7247.978, StdDeviation   =     2439.322]
#[Max     =    46006.272, Total count    =         2678]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14957 requests in 1.00m, 3.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 1046
  Non-2xx or 3xx responses: 14957
Requests/sec:    249.06
Transfer/sec:     63.16KB